{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "0111",
    "1": "0112",
    "2": "0120",
    "3": "0211",
    "4": "0212",
    "5": "0213",
    "6": "0220",
    "7": "0311",
    "8": "0312",
    "9": "0313",
    "10": "1111",
    "11": "1113",
    "12": "1114",
    "13": "1131",
    "14": "1133",
    "15": "1143",
    "16": "1166",
    "17": "1167",
    "18": "1169",
    "19": "1211",
    "20": "1221",
    "21": "1321",
    "22": "1323",
    "23": "1341",
    "24": "1345",
    "25": "1346",
    "26": "1422",
    "27": "1499",
    "28": "2113",
    "29": "2114",
    "30": "2120",
    "31": "2131",
    "32": "2132",
    "33": "2141",
    "34": "2142",
    "35": "2143",
    "36": "2144",
    "37": "2145",
    "38": "2146",
    "39": "2149",
    "40": "2151",
    "41": "2152",
    "42": "2161",
    "43": "2162",
    "44": "2163",
    "45": "2166",
    "46": "2211",
    "47": "2212",
    "48": "2221",
    "49": "2222",
    "50": "2240",
    "51": "2251",
    "52": "2252",
    "53": "2254",
    "54": "2255",
    "55": "2256",
    "56": "2257",
    "57": "2311",
    "58": "2312",
    "59": "2320",
    "60": "2330",
    "61": "2341",
    "62": "2342",
    "63": "2351",
    "64": "2352",
    "65": "2353",
    "66": "2359",
    "67": "2411",
    "68": "2412",
    "69": "2421",
    "70": "2422",
    "71": "2431",
    "72": "2432",
    "73": "2511",
    "74": "2512",
    "75": "2513",
    "76": "2521",
    "77": "2611",
    "78": "2619",
    "79": "2631",
    "80": "2632",
    "81": "2634",
    "82": "2635",
    "83": "2636",
    "84": "2641",
    "85": "2642",
    "86": "2643",
    "87": "2651",
    "88": "2656",
    "89": "3111",
    "90": "3112",
    "91": "3113",
    "92": "3114",
    "93": "3115",
    "94": "3117",
    "95": "3118",
    "96": "3119",
    "97": "3121",
    "98": "3122",
    "99": "3123",
    "100": "3124",
    "101": "3125",
    "102": "3126",
    "103": "3129",
    "104": "3131",
    "105": "3132",
    "106": "3141",
    "107": "3142",
    "108": "3143",
    "109": "3145",
    "110": "3149",
    "111": "3151",
    "112": "3152",
    "113": "3153",
    "114": "3211",
    "115": "3212",
    "116": "3213",
    "117": "3215",
    "118": "3221",
    "119": "3230",
    "120": "3240",
    "121": "3251",
    "122": "3253",
    "123": "3255",
    "124": "3256",
    "125": "3257",
    "126": "3258",
    "127": "3259",
    "128": "3313",
    "129": "3314",
    "130": "3315",
    "131": "3316",
    "132": "3317",
    "133": "3321",
    "134": "3322",
    "135": "3323",
    "136": "3331",
    "137": "3332",
    "138": "3334",
    "139": "3339",
    "140": "3341",
    "141": "3411",
    "142": "3412",
    "143": "3413",
    "144": "3421",
    "145": "3422",
    "146": "3423",
    "147": "3431",
    "148": "3432",
    "149": "3434",
    "150": "3439",
    "151": "3511",
    "152": "3512",
    "153": "3513",
    "154": "3514",
    "155": "3521",
    "156": "3522",
    "157": "3523",
    "158": "4110",
    "159": "4120",
    "160": "4131",
    "161": "4132",
    "162": "4211",
    "163": "4212",
    "164": "4213",
    "165": "4214",
    "166": "4221",
    "167": "4222",
    "168": "4223",
    "169": "4224",
    "170": "4225",
    "171": "4229",
    "172": "4311",
    "173": "4312",
    "174": "4313",
    "175": "4321",
    "176": "4323",
    "177": "4411",
    "178": "4412",
    "179": "4414",
    "180": "4415",
    "181": "4416",
    "182": "4417",
    "183": "4419",
    "184": "5111",
    "185": "5112",
    "186": "5113",
    "187": "5120",
    "188": "5131",
    "189": "5132",
    "190": "5141",
    "191": "5142",
    "192": "5211",
    "193": "5212",
    "194": "5213",
    "195": "5221",
    "196": "5222",
    "197": "5223",
    "198": "5230",
    "199": "5241",
    "200": "5243",
    "201": "5244",
    "202": "5245",
    "203": "5311",
    "204": "5312",
    "205": "5321",
    "206": "5322",
    "207": "5329",
    "208": "5412",
    "209": "5413",
    "210": "5414",
    "211": "5419",
    "212": "6111",
    "213": "6112",
    "214": "6113",
    "215": "6114",
    "216": "6121",
    "217": "6122",
    "218": "6123",
    "219": "6210",
    "220": "6221",
    "221": "6222",
    "222": "6223",
    "223": "6224",
    "224": "6310",
    "225": "6320",
    "226": "7111",
    "227": "7112",
    "228": "7113",
    "229": "7119",
    "230": "7121",
    "231": "7122",
    "232": "7123",
    "233": "7125",
    "234": "7126",
    "235": "7127",
    "236": "7128",
    "237": "7129",
    "238": "7212",
    "239": "7213",
    "240": "7214",
    "241": "7221",
    "242": "7222",
    "243": "7223",
    "244": "7224",
    "245": "7231",
    "246": "7233",
    "247": "7234",
    "248": "7235",
    "249": "7311",
    "250": "7312",
    "251": "7313",
    "252": "7321",
    "253": "7322",
    "254": "7331",
    "255": "7332",
    "256": "7333",
    "257": "7341",
    "258": "7342",
    "259": "7351",
    "260": "7352",
    "261": "7353",
    "262": "7354",
    "263": "7355",
    "264": "7356",
    "265": "7361",
    "266": "7362",
    "267": "7391",
    "268": "7392",
    "269": "7399",
    "270": "7411",
    "271": "7412",
    "272": "7421",
    "273": "7422",
    "274": "7431",
    "275": "7432",
    "276": "7511",
    "277": "7512",
    "278": "7513",
    "279": "7514",
    "280": "7515",
    "281": "7517",
    "282": "7518",
    "283": "7519",
    "284": "8111",
    "285": "8112",
    "286": "8113",
    "287": "8114",
    "288": "8121",
    "289": "8131",
    "290": "8141",
    "291": "8142",
    "292": "8151",
    "293": "8152",
    "294": "8153",
    "295": "8154",
    "296": "8156",
    "297": "8159",
    "298": "8160",
    "299": "8171",
    "300": "8173",
    "301": "8181",
    "302": "8183",
    "303": "8189",
    "304": "8321",
    "305": "8322",
    "306": "8331",
    "307": "8332",
    "308": "8341",
    "309": "8342",
    "310": "8343",
    "311": "8351",
    "312": "8352",
    "313": "9111",
    "314": "9112",
    "315": "9121",
    "316": "9122",
    "317": "9124",
    "318": "9129",
    "319": "9211",
    "320": "9212",
    "321": "9213",
    "322": "9214",
    "323": "9311",
    "324": "9312",
    "325": "9313",
    "326": "9321",
    "327": "9329",
    "328": "9331",
    "329": "9332",
    "330": "9333",
    "331": "9334",
    "332": "9411",
    "333": "9412",
    "334": "9511",
    "335": "9512",
    "336": "9521",
    "337": "9522",
    "338": "9523",
    "339": "9524",
    "340": "9531",
    "341": "9533",
    "342": "9534",
    "343": "9535",
    "344": "9536",
    "345": "9537",
    "346": "9541",
    "347": "9542",
    "348": "9549",
    "349": "9611",
    "350": "9612",
    "351": "9613",
    "352": "9621",
    "353": "9622",
    "354": "9623",
    "355": "9624",
    "356": "9629"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "0111": 0,
    "0112": 1,
    "0120": 2,
    "0211": 3,
    "0212": 4,
    "0213": 5,
    "0220": 6,
    "0311": 7,
    "0312": 8,
    "0313": 9,
    "1111": 10,
    "1113": 11,
    "1114": 12,
    "1131": 13,
    "1133": 14,
    "1143": 15,
    "1166": 16,
    "1167": 17,
    "1169": 18,
    "1211": 19,
    "1221": 20,
    "1321": 21,
    "1323": 22,
    "1341": 23,
    "1345": 24,
    "1346": 25,
    "1422": 26,
    "1499": 27,
    "2113": 28,
    "2114": 29,
    "2120": 30,
    "2131": 31,
    "2132": 32,
    "2141": 33,
    "2142": 34,
    "2143": 35,
    "2144": 36,
    "2145": 37,
    "2146": 38,
    "2149": 39,
    "2151": 40,
    "2152": 41,
    "2161": 42,
    "2162": 43,
    "2163": 44,
    "2166": 45,
    "2211": 46,
    "2212": 47,
    "2221": 48,
    "2222": 49,
    "2240": 50,
    "2251": 51,
    "2252": 52,
    "2254": 53,
    "2255": 54,
    "2256": 55,
    "2257": 56,
    "2311": 57,
    "2312": 58,
    "2320": 59,
    "2330": 60,
    "2341": 61,
    "2342": 62,
    "2351": 63,
    "2352": 64,
    "2353": 65,
    "2359": 66,
    "2411": 67,
    "2412": 68,
    "2421": 69,
    "2422": 70,
    "2431": 71,
    "2432": 72,
    "2511": 73,
    "2512": 74,
    "2513": 75,
    "2521": 76,
    "2611": 77,
    "2619": 78,
    "2631": 79,
    "2632": 80,
    "2634": 81,
    "2635": 82,
    "2636": 83,
    "2641": 84,
    "2642": 85,
    "2643": 86,
    "2651": 87,
    "2656": 88,
    "3111": 89,
    "3112": 90,
    "3113": 91,
    "3114": 92,
    "3115": 93,
    "3117": 94,
    "3118": 95,
    "3119": 96,
    "3121": 97,
    "3122": 98,
    "3123": 99,
    "3124": 100,
    "3125": 101,
    "3126": 102,
    "3129": 103,
    "3131": 104,
    "3132": 105,
    "3141": 106,
    "3142": 107,
    "3143": 108,
    "3145": 109,
    "3149": 110,
    "3151": 111,
    "3152": 112,
    "3153": 113,
    "3211": 114,
    "3212": 115,
    "3213": 116,
    "3215": 117,
    "3221": 118,
    "3230": 119,
    "3240": 120,
    "3251": 121,
    "3253": 122,
    "3255": 123,
    "3256": 124,
    "3257": 125,
    "3258": 126,
    "3259": 127,
    "3313": 128,
    "3314": 129,
    "3315": 130,
    "3316": 131,
    "3317": 132,
    "3321": 133,
    "3322": 134,
    "3323": 135,
    "3331": 136,
    "3332": 137,
    "3334": 138,
    "3339": 139,
    "3341": 140,
    "3411": 141,
    "3412": 142,
    "3413": 143,
    "3421": 144,
    "3422": 145,
    "3423": 146,
    "3431": 147,
    "3432": 148,
    "3434": 149,
    "3439": 150,
    "3511": 151,
    "3512": 152,
    "3513": 153,
    "3514": 154,
    "3521": 155,
    "3522": 156,
    "3523": 157,
    "4110": 158,
    "4120": 159,
    "4131": 160,
    "4132": 161,
    "4211": 162,
    "4212": 163,
    "4213": 164,
    "4214": 165,
    "4221": 166,
    "4222": 167,
    "4223": 168,
    "4224": 169,
    "4225": 170,
    "4229": 171,
    "4311": 172,
    "4312": 173,
    "4313": 174,
    "4321": 175,
    "4323": 176,
    "4411": 177,
    "4412": 178,
    "4414": 179,
    "4415": 180,
    "4416": 181,
    "4417": 182,
    "4419": 183,
    "5111": 184,
    "5112": 185,
    "5113": 186,
    "5120": 187,
    "5131": 188,
    "5132": 189,
    "5141": 190,
    "5142": 191,
    "5211": 192,
    "5212": 193,
    "5213": 194,
    "5221": 195,
    "5222": 196,
    "5223": 197,
    "5230": 198,
    "5241": 199,
    "5243": 200,
    "5244": 201,
    "5245": 202,
    "5311": 203,
    "5312": 204,
    "5321": 205,
    "5322": 206,
    "5329": 207,
    "5412": 208,
    "5413": 209,
    "5414": 210,
    "5419": 211,
    "6111": 212,
    "6112": 213,
    "6113": 214,
    "6114": 215,
    "6121": 216,
    "6122": 217,
    "6123": 218,
    "6210": 219,
    "6221": 220,
    "6222": 221,
    "6223": 222,
    "6224": 223,
    "6310": 224,
    "6320": 225,
    "7111": 226,
    "7112": 227,
    "7113": 228,
    "7119": 229,
    "7121": 230,
    "7122": 231,
    "7123": 232,
    "7125": 233,
    "7126": 234,
    "7127": 235,
    "7128": 236,
    "7129": 237,
    "7212": 238,
    "7213": 239,
    "7214": 240,
    "7221": 241,
    "7222": 242,
    "7223": 243,
    "7224": 244,
    "7231": 245,
    "7233": 246,
    "7234": 247,
    "7235": 248,
    "7311": 249,
    "7312": 250,
    "7313": 251,
    "7321": 252,
    "7322": 253,
    "7331": 254,
    "7332": 255,
    "7333": 256,
    "7341": 257,
    "7342": 258,
    "7351": 259,
    "7352": 260,
    "7353": 261,
    "7354": 262,
    "7355": 263,
    "7356": 264,
    "7361": 265,
    "7362": 266,
    "7391": 267,
    "7392": 268,
    "7399": 269,
    "7411": 270,
    "7412": 271,
    "7421": 272,
    "7422": 273,
    "7431": 274,
    "7432": 275,
    "7511": 276,
    "7512": 277,
    "7513": 278,
    "7514": 279,
    "7515": 280,
    "7517": 281,
    "7518": 282,
    "7519": 283,
    "8111": 284,
    "8112": 285,
    "8113": 286,
    "8114": 287,
    "8121": 288,
    "8131": 289,
    "8141": 290,
    "8142": 291,
    "8151": 292,
    "8152": 293,
    "8153": 294,
    "8154": 295,
    "8156": 296,
    "8159": 297,
    "8160": 298,
    "8171": 299,
    "8173": 300,
    "8181": 301,
    "8183": 302,
    "8189": 303,
    "8321": 304,
    "8322": 305,
    "8331": 306,
    "8332": 307,
    "8341": 308,
    "8342": 309,
    "8343": 310,
    "8351": 311,
    "8352": 312,
    "9111": 313,
    "9112": 314,
    "9121": 315,
    "9122": 316,
    "9124": 317,
    "9129": 318,
    "9211": 319,
    "9212": 320,
    "9213": 321,
    "9214": 322,
    "9311": 323,
    "9312": 324,
    "9313": 325,
    "9321": 326,
    "9329": 327,
    "9331": 328,
    "9332": 329,
    "9333": 330,
    "9334": 331,
    "9411": 332,
    "9412": 333,
    "9511": 334,
    "9512": 335,
    "9521": 336,
    "9522": 337,
    "9523": 338,
    "9524": 339,
    "9531": 340,
    "9533": 341,
    "9534": 342,
    "9535": 343,
    "9536": 344,
    "9537": 345,
    "9541": 346,
    "9542": 347,
    "9549": 348,
    "9611": 349,
    "9612": 350,
    "9613": 351,
    "9621": 352,
    "9622": 353,
    "9623": 354,
    "9624": 355,
    "9629": 356
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31002
}
